# Terminal and stuff
brew "git"
brew "zsh"
brew "zsh"
brew "nvm"

# vscode extensions I normally used
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "dnlytras.nord-wave"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "kamikillerto.vscode-colorize"
vscode "liviuschera.noctis"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "nyxb.vscode-styled-colors"
vscode "patrickfatrick.cattleya-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.rainbow-bracket"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "wmaurer.vscode-jumpy"
